package chapter7

object Question10 {


  // マインスイーパ:テキストベースでマインスイーパのゲームをデザイン・実装してください。
  // マインスイーパは1人で遊ぶ古典的なコンピュータゲームで、N×Nの盤面の中にB個の地雷(もしくは爆弾)が隠されています。
  // ほかのマス目は空白になっているか、裏に数字が書かれています。
  // 数字は周囲の8マスに隠された爆弾の数を表しています。
  // プレイヤーはマス目を開けていきます。
  // もしそこが爆弾であればプレイヤーの負けです。数字が隠されていれば、それが見られるようになります。
  // 空白のマス目の場合はそのマス目と隣接するすべての空白になっているマス目(数値のマス目が現れるまで)が開かれた状態になります。
  // 爆弾が隠されていないマス目をすべて開けることができれば、プレイヤーの勝ちとなります。
  // また、プレイヤーは間違いなく爆弾が隠されているとわかる場所に目印を付けることができます。
  // これはゲームの進行に影響するものではなく、うっかり爆弾があるところを開けてしまわないようにするためです。(読者の方へ:このゲームに馴染みのない方は、まず遊んでみてください)

}
